{
  "scrape_date": "2025-10-09T12:53:52.199072",
  "total_phones": 162,
  "source": "https://www.gsmarena.com/sony-phones-7.php",
  "phones": [
    {
      "name": "Xperia 10 VII",
      "title": "Sony Xperia 10 VII 5G Android smartphone. Announced Sep 2025. Features 6.1″  display, Snapdragon 6 Gen 3 chipset, 5000 mAh battery, 128 GB storage, 8 GB RAM, Corning Gorilla Glass Victus 2.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-10-vii-.jpg",
      "specs": ""
    },
    {
      "name": "Xperia 1 VII",
      "title": "Sony Xperia 1 VII 5G Android smartphone. Announced May 2025. Features 6.5″  display, Snapdragon 8 Elite chipset, 5000 mAh battery, 512 GB storage, 12 GB RAM, Corning Gorilla Glass Victus 2.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-1-vii-violet.jpg",
      "specs": ""
    },
    {
      "name": "Xperia 1 VI",
      "title": "Sony Xperia 1 VI Android smartphone. Announced May 2024. Features 6.5″  display, Snapdragon 8 Gen 3 chipset, 5000 mAh battery, 512 GB storage, 12 GB RAM, Corning Gorilla Glass Victus 2.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-1-vi-red.jpg",
      "specs": ""
    },
    {
      "name": "Xperia 10 VI",
      "title": "Sony Xperia 10 VI Android smartphone. Announced May 2024. Features 6.1″  display, Snapdragon 6 Gen 1 chipset, 5000 mAh battery, 128 GB storage, 8 GB RAM, Corning Gorilla Glass Victus.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-10-vi.jpg",
      "specs": ""
    },
    {
      "name": "Xperia 5 V",
      "title": "Sony Xperia 5 V Android smartphone. Announced Sep 2023. Features 6.1″  display, Snapdragon 8 Gen 2 chipset, 5000 mAh battery, 256 GB storage, 8 GB RAM, Corning Gorilla Glass Victus 2.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-5-v-new.jpg",
      "specs": ""
    },
    {
      "name": "Xperia 1 V",
      "title": "Sony Xperia 1 V Android smartphone. Announced May 2023. Features 6.5″  display, Snapdragon 8 Gen 2 chipset, 5000 mAh battery, 512 GB storage, 12 GB RAM, Corning Gorilla Glass Victus 2.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-1-v.jpg",
      "specs": ""
    },
    {
      "name": "Xperia 10 V",
      "title": "Sony Xperia 10 V Android smartphone. Announced May 2023. Features 6.1″  display, Snapdragon 695 5G chipset, 5000 mAh battery, 128 GB storage, 8 GB RAM, Corning Gorilla Glass Victus.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-10-v-10.jpg",
      "specs": ""
    },
    {
      "name": "Xperia 5 IV",
      "title": "Sony Xperia 5 IV Android smartphone. Announced Sep 2022. Features 6.1″  display, Snapdragon 8 Gen 1 chipset, 5000 mAh battery, 256 GB storage, 8 GB RAM, Corning Gorilla Glass Victus.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-5-iv-ofic.jpg",
      "specs": ""
    },
    {
      "name": "Xperia 1 IV",
      "title": "Sony Xperia 1 IV Android smartphone. Announced May 2022. Features 6.5″  display, Snapdragon 8 Gen 1 chipset, 5000 mAh battery, 512 GB storage, 16 GB RAM, Corning Gorilla Glass Victus.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-1-iv-.jpg",
      "specs": ""
    },
    {
      "name": "Xperia 10 IV",
      "title": "Sony Xperia 10 IV Android smartphone. Announced May 2022. Features 6.0″  display, Snapdragon 695 5G chipset, 5000 mAh battery, 128 GB storage, 6 GB RAM, Corning Gorilla Glass Victus.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-10-iv.jpg",
      "specs": ""
    },
    {
      "name": "Xperia Pro-I",
      "title": "Sony Xperia Pro-I Android smartphone. Announced Oct 2021. Features 6.5″  display, Snapdragon 888 5G chipset, 4500 mAh battery, 512 GB storage, 12 GB RAM, Corning Gorilla Glass Victus.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-pro-i.jpg",
      "specs": ""
    },
    {
      "name": "Xperia 10 III Lite",
      "title": "Sony Xperia 10 III Lite Android smartphone. Announced Aug 2021. Features 6.0″  display, Snapdragon 690 5G chipset, 4500 mAh battery, 64 GB storage, 6 GB RAM, Corning Gorilla Glass 6.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-10-iii-lite.jpg",
      "specs": ""
    },
    {
      "name": "Xperia 1 III",
      "title": "Sony Xperia 1 III Android smartphone. Announced Apr 2021. Features 6.5″  display, Snapdragon 888 5G chipset, 4500 mAh battery, 512 GB storage, 12 GB RAM, Corning Gorilla Glass Victus.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-1-iii.jpg",
      "specs": ""
    },
    {
      "name": "Xperia 5 III",
      "title": "Sony Xperia 5 III Android smartphone. Announced Apr 2021. Features 6.1″  display, Snapdragon 888 5G chipset, 4500 mAh battery, 256 GB storage, 8 GB RAM, Corning Gorilla Glass 6.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-5-iii.jpg",
      "specs": ""
    },
    {
      "name": "Xperia 10 III",
      "title": "Sony Xperia 10 III Android smartphone. Announced Apr 2021. Features 6.0″  display, Snapdragon 690 5G chipset, 4500 mAh battery, 256 GB storage, 6 GB RAM, Corning Gorilla Glass 6.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-10-iii.jpg",
      "specs": ""
    },
    {
      "name": "Xperia Pro",
      "title": "Sony Xperia Pro Android smartphone. Announced Feb 2020. Features 6.5″  display, Snapdragon 865 5G chipset, 4000 mAh battery, 512 GB storage, 12 GB RAM, Corning Gorilla Glass 6.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-pro-5g.jpg",
      "specs": ""
    },
    {
      "name": "Xperia 5 II",
      "title": "Sony Xperia 5 II Android smartphone. Announced Sep 2020. Features 6.1″  display, Snapdragon 865 5G chipset, 4000 mAh battery, 256 GB storage, 8 GB RAM, Corning Gorilla Glass 6.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-5-ii-5g-r.jpg",
      "specs": ""
    },
    {
      "name": "Xperia 1 II",
      "title": "Sony Xperia 1 II Android smartphone. Announced Feb 2020. Features 6.5″  display, Snapdragon 865 5G chipset, 4000 mAh battery, 256 GB storage, 12 GB RAM, Corning Gorilla Glass 6.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-1-II-o.jpg",
      "specs": ""
    },
    {
      "name": "Xperia 10 II",
      "title": "Sony Xperia 10 II Android smartphone. Announced Feb 2020. Features 6.0″  display, Snapdragon 665 chipset, 3600 mAh battery, 128 GB storage, 4 GB RAM, Corning Gorilla Glass 6.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-10-II-o.jpg",
      "specs": ""
    },
    {
      "name": "Xperia L4",
      "title": "Sony Xperia L4 Android smartphone. Announced Feb 2020. Features 6.2″  display, MT6762 Helio P22 chipset, 3580 mAh battery, 64 GB storage, 3 GB RAM.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-l4.jpg",
      "specs": ""
    },
    {
      "name": "Xperia 5",
      "title": "Sony Xperia 5 Android smartphone. Announced Sep 2019. Features 6.1″  display, Snapdragon 855 chipset, 3140 mAh battery, 128 GB storage, 6 GB RAM, Corning Gorilla Glass 6.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-5-.jpg",
      "specs": ""
    },
    {
      "name": "Xperia 1",
      "title": "Sony Xperia 1 Android smartphone. Announced Feb 2019. Features 6.5″  display, Snapdragon 855 chipset, 3330 mAh battery, 128 GB storage, 6 GB RAM, Corning Gorilla Glass 6.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-1.jpg",
      "specs": ""
    },
    {
      "name": "Xperia 10 Plus",
      "title": "Sony Xperia 10 Plus Android smartphone. Announced Feb 2019. Features 6.5″  display, Snapdragon 636 chipset, 3000 mAh battery, 64 GB storage, 6 GB RAM, Corning Gorilla Glass 5.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-10-plus-.jpg",
      "specs": ""
    },
    {
      "name": "Xperia 10",
      "title": "Sony Xperia 10 Android smartphone. Announced Feb 2019. Features 6.0″  display, Snapdragon 630 chipset, 2870 mAh battery, 64 GB storage, 4 GB RAM, Corning Gorilla Glass 5.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-10-.jpg",
      "specs": ""
    },
    {
      "name": "Xperia L3",
      "title": "Sony Xperia L3 Android smartphone. Announced Feb 2019. Features 5.7″  display, MT6762 Helio P22 chipset, 3300 mAh battery, 32 GB storage, 3 GB RAM, Corning Gorilla Glass 5.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-l3.jpg",
      "specs": ""
    },
    {
      "name": "Xperia XA2 Plus",
      "title": "Sony Xperia XA2 Plus Android smartphone. Announced Jul 2018. Features 6.0″  display, Snapdragon 630 chipset, 23 MP primary camera, 8 MP front camera, 3580 mAh battery, 64 GB storage, 6 GB RAM, Corning Gorilla Glass 5.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-xa2-plus-.jpg",
      "specs": ""
    },
    {
      "name": "Xperia XZ3",
      "title": "Sony Xperia XZ3 Android smartphone. Announced Aug 2018. Features 6.0″  display, Snapdragon 845 chipset, 19 MP primary camera, 13 MP front camera, 3300 mAh battery, 64 GB storage, 6 GB RAM, Corning Gorilla Glass 5.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-xz3-.jpg",
      "specs": ""
    },
    {
      "name": "Xperia XZ2 Premium",
      "title": "Sony Xperia XZ2 Premium Android smartphone. Announced Apr 2018. Features 5.8″  display, Snapdragon 845 chipset, 3540 mAh battery, 64 GB storage, 6 GB RAM, Corning Gorilla Glass 5.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-xz2-premium.jpg",
      "specs": ""
    },
    {
      "name": "Xperia XZ2",
      "title": "Sony Xperia XZ2 Android smartphone. Announced Feb 2018. Features 5.7″  display, Snapdragon 845 chipset, 19 MP primary camera, 5 MP front camera, 3180 mAh battery, 64 GB storage, 6 GB RAM, Corning Gorilla Glass 5.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-xz2-.jpg",
      "specs": ""
    },
    {
      "name": "Xperia XZ2 Compact",
      "title": "Sony Xperia XZ2 Compact Android smartphone. Announced Feb 2018. Features 5.0″  display, Snapdragon 845 chipset, 19 MP primary camera, 5 MP front camera, 2870 mAh battery, 64 GB storage, 4 GB RAM, Corning Gorilla Glass 5.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-xz2-compact-.jpg",
      "specs": ""
    },
    {
      "name": "Xperia XA2 Ultra",
      "title": "Sony Xperia XA2 Ultra Android smartphone. Announced Jan 2018. Features 6.0″  display, Snapdragon 630 chipset, 23 MP primary camera, Dual: 16 MP (f/2.0, 23mm, 1/2.6″, OIS, AF) + 8 MP front camera, 3580 mAh battery, 64 GB storage, 4 GB RAM, Corning Gorilla Glass 4.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-xa2-ultra-.jpg",
      "specs": ""
    },
    {
      "name": "Xperia XA2",
      "title": "Sony Xperia XA2 Android smartphone. Announced Jan 2018. Features 5.2″  display, Snapdragon 630 chipset, 23 MP primary camera, 8 MP front camera, 3300 mAh battery, 32 GB storage, 3 GB RAM, Corning Gorilla Glass 4.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-xa2-.jpg",
      "specs": ""
    },
    {
      "name": "Xperia L2",
      "title": "Sony Xperia L2 Android smartphone. Announced Jan 2018. Features 5.5″  display, MT6737T chipset, 13 MP primary camera, 8 MP front camera, 3300 mAh battery, 32 GB storage, 3 GB RAM, Corning Gorilla Glass 4.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-l2-.jpg",
      "specs": ""
    },
    {
      "name": "Xperia R1 (Plus)",
      "title": "Sony Xperia R1 (Plus) Android smartphone. Announced Oct 2017. Features 5.2″  display, Snapdragon 430 chipset, 13 MP primary camera, 8 MP front camera, 2620 mAh battery, 32 GB storage, 3 GB RAM.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-r1.jpg",
      "specs": ""
    },
    {
      "name": "Xperia XZ1",
      "title": "Sony Xperia XZ1 Android smartphone. Announced Aug 2017. Features 5.2″  display, Snapdragon 835 chipset, 19 MP primary camera, 13 MP front camera, 2700 mAh battery, 64 GB storage, 4 GB RAM, Corning Gorilla Glass 5.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-xz1-ofic.jpg",
      "specs": ""
    },
    {
      "name": "Xperia XA1 Plus",
      "title": "Sony Xperia XA1 Plus Android smartphone. Announced Aug 2017. Features 5.5″  display, MT6757 Helio P20 chipset, 23 MP primary camera, 8 MP front camera, 3430 mAh battery, 32 GB storage, 4 GB RAM, Corning Gorilla Glass 4.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-xa1-plus.jpg",
      "specs": ""
    },
    {
      "name": "Xperia XZ1 Compact",
      "title": "Sony Xperia XZ1 Compact Android smartphone. Announced Aug 2017. Features 4.6″  display, Snapdragon 835 chipset, 19 MP primary camera, 8 MP front camera, 2700 mAh battery, 32 GB storage, 4 GB RAM, Corning Gorilla Glass 5.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-xz1-compact.jpg",
      "specs": ""
    },
    {
      "name": "Xperia L1",
      "title": "Sony Xperia L1 Android smartphone. Announced Mar 2017. Features 5.5″  display, MT6737T chipset, 13 MP primary camera, 5 MP front camera, 2620 mAh battery, 16 GB storage, 2 GB RAM, Scratch-resistant glass ( 6H).",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-l1-.jpg",
      "specs": ""
    },
    {
      "name": "Xperia XZs",
      "title": "Sony Xperia XZs Android smartphone. Announced Feb 2017. Features 5.2″  display, Snapdragon 820 chipset, 19 MP primary camera, 13 MP front camera, 2900 mAh battery, 64 GB storage, 4 GB RAM, Corning Gorilla Glass 5.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-xzs-2017.jpg",
      "specs": ""
    },
    {
      "name": "Xperia XZ Premium",
      "title": "Sony Xperia XZ Premium Android smartphone. Announced Feb 2017. Features 5.46″  display, Snapdragon 835 chipset, 19 MP primary camera, 13 MP front camera, 3230 mAh battery, 64 GB storage, 4 GB RAM, Corning Gorilla Glass 5.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-xz-premium-2017.jpg",
      "specs": ""
    },
    {
      "name": "Xperia XA1 Ultra",
      "title": "Sony Xperia XA1 Ultra Android smartphone. Announced Feb 2017. Features 6.0″  display, MT6757 Helio P20 chipset, 23 MP primary camera, 16 MP front camera, 2700 mAh battery, 64 GB storage, 4 GB RAM, Corning Gorilla Glass 4.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-xa1-ultra-2017.jpg",
      "specs": ""
    },
    {
      "name": "Xperia XA1",
      "title": "Sony Xperia XA1 Android smartphone. Announced Feb 2017. Features 5.0″  display, MT6757 Helio P20 chipset, 23 MP primary camera, 8 MP front camera, 2300 mAh battery, 32 GB storage, 3 GB RAM, Corning Gorilla Glass 4.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-xa1-2017.jpg",
      "specs": ""
    },
    {
      "name": "Xperia X Compact",
      "title": "Sony Xperia X Compact Android smartphone. Announced Sep 2016. Features 4.6″  display, Snapdragon 650 chipset, 23 MP primary camera, 5 MP front camera, 2700 mAh battery, 32 GB storage, 3 GB RAM, Corning Gorilla Glass 4.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-x-compact.jpg",
      "specs": ""
    },
    {
      "name": "Xperia XZ",
      "title": "Sony Xperia XZ Android smartphone. Announced Sep 2016. Features 5.2″  display, Snapdragon 820 chipset, 23 MP primary camera, 13 MP front camera, 2900 mAh battery, 64 GB storage, 3 GB RAM, Corning Gorilla Glass 4.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-xz.jpg",
      "specs": ""
    },
    {
      "name": "Xperia E5",
      "title": "Sony Xperia E5 Android smartphone. Announced May 2016. Features 5.0″  display, MT6735 chipset, 13 MP primary camera, 5 MP front camera, 2300 mAh battery, 16 GB storage, 1.5 GB RAM, Scratch-resistant glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-e5r.jpg",
      "specs": ""
    },
    {
      "name": "Xperia XA Ultra",
      "title": "Sony Xperia XA Ultra Android smartphone. Announced May 2016. Features 6.0″  display, MT6755 Helio P10 chipset, 21.5 MP primary camera, 16 MP front camera, 2700 mAh battery, 16 GB storage, 3 GB RAM, Scratch-resistant glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-xa-ultra.jpg",
      "specs": ""
    },
    {
      "name": "Xperia X Performance",
      "title": "Sony Xperia X Performance Android smartphone. Announced Feb 2016. Features 5.0″  display, Snapdragon 820 chipset, 23 MP primary camera, 13 MP front camera, 2700 mAh battery, 64 GB storage, 3 GB RAM, Scratch-resistant glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-x-performance.jpg",
      "specs": ""
    },
    {
      "name": "Xperia X",
      "title": "Sony Xperia X Android smartphone. Announced Feb 2016. Features 5.0″  display, Snapdragon 650 chipset, 23 MP primary camera, 13 MP front camera, 2620 mAh battery, 64 GB storage, 3 GB RAM, Scratch-resistant glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-xa.jpg",
      "specs": ""
    },
    {
      "name": "Xperia XA Dual",
      "title": "Sony Xperia XA Dual Android smartphone. Announced Feb 2016. Features 5.0″  display, MT6755 Helio P10 chipset, 13 MP primary camera, 8 MP front camera, 2300 mAh battery, 16 GB storage, 2 GB RAM, Scratch-resistant glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-xa--.jpg",
      "specs": ""
    },
    {
      "name": "Xperia XA",
      "title": "Sony Xperia XA Android smartphone. Announced Feb 2016. Features 5.0″  display, MT6755 Helio P10 chipset, 13 MP primary camera, 8 MP front camera, 2300 mAh battery, 16 GB storage, 2 GB RAM, Scratch-resistant glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-xa--.jpg",
      "specs": ""
    },
    {
      "name": "CM-DX 2000",
      "title": "Sony CM-DX 2000 phone. Announced  1997. Features Monochrome graphic display, 1800 mAh battery.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sox2000b.gif",
      "specs": ""
    },
    {
      "name": "CM-DX 1000",
      "title": "Sony CM-DX 1000 phone. Announced  1997. Features Monochrome graphic display, 1350 mAh battery.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sox1000b.gif",
      "specs": ""
    },
    {
      "name": "Xperia 5 Plus",
      "title": "Sony Xperia 5 Plus Android smartphone. Not announced yet. Features 6.6″  display, Snapdragon 855 chipset, 4000 mAh battery, 256 GB storage, 8 GB RAM, Corning Gorilla Glass 6.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-5-plus-r.jpg",
      "specs": ""
    },
    {
      "name": "Xperia X Ultra",
      "title": "Sony Xperia X Ultra Android smartphone. Not announced yet. Features 6.45″  display, Snapdragon 660 chipset, 19 MP primary camera, 13 MP front camera, 3050 mAh battery, 64 GB storage, 4 GB RAM.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-x-ultra-r.jpg",
      "specs": ""
    },
    {
      "name": "Xperia H8541",
      "title": "Sony Xperia H8541 Android smartphone. Not announced yet. Features 5.7″  display, Snapdragon 835 chipset, 19 MP primary camera, 13 MP front camera, 3420 mAh battery, 64 GB storage, 4 GB RAM.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/smartphone.jpg",
      "specs": ""
    },
    {
      "name": "Xperia M Ultra",
      "title": "Sony Xperia M Ultra Android smartphone. Not announced yet. Features 6.0″  display, Snapdragon 652 chipset, Dual: 23 MP primary camera, 16 MP front camera, 4280 mAh battery, 32 GB storage, 3 GB RAM, Scratch-resistant glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/smartphone.jpg",
      "specs": ""
    },
    {
      "name": "Xperia X Premium",
      "title": "Sony Xperia X Premium Android smartphone. Not announced yet. Features 5.5″  display, Snapdragon 820 chipset, 23 MP primary camera, 13 MP front camera, 64 GB storage, 3 GB RAM, Scratch-resistant glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/smartphone.jpg",
      "specs": ""
    },
    {
      "name": "Xperia E1 II",
      "title": "Sony Xperia E1 II Android smartphone. Announced Q3 2015. Features 4.0″  display, 5 MP primary camera, 2 MP front camera, 8 GB storage, 1000 MB RAM, Scratch-resistant glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/smartphone.jpg",
      "specs": ""
    },
    {
      "name": "Xperia Z4 Ultra",
      "title": "Sony Xperia Z4 Ultra Android smartphone. Announced Q3 2015. Features 6.44″  display, Snapdragon 810 chipset, 16 MP primary camera, 4000 mAh battery, 32 GB storage, 3 GB RAM, Shatter proof glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony.jpg",
      "specs": ""
    },
    {
      "name": "Xperia Z4 Compact",
      "title": "Sony Xperia Z4 Compact Android smartphone. Announced Q3 2015. Features 4.7″  display, Snapdragon 810 chipset, 20.7 MP primary camera, 5 MP front camera, 32 GB storage, 3 GB RAM, Shatter proof glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/smartphone.jpg",
      "specs": ""
    },
    {
      "name": "D 2403",
      "title": "Sony D 2403 Android smartphone. Announced Q3 2014. Features 4.4″  display, Snapdragon 400 chipset, 8 MP primary camera, 16 GB storage, 1000 MB RAM.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony.jpg",
      "specs": ""
    },
    {
      "name": "Xperia C670X",
      "title": "Sony Xperia C670X Android smartphone. Announced  2013. Features 4.8″  display, Snapdragon 600 chipset, 13.1 MP primary camera, 2.2 MP front camera, 32 GB storage, 2 GB RAM.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony.jpg",
      "specs": ""
    },
    {
      "name": "Xperia Z5 Premium Dual",
      "title": "Sony Xperia Z5 Premium Dual Android smartphone. Announced Sep 2015. Features 5.5″  display, Snapdragon 810 chipset, 23 MP primary camera, 5.1 MP front camera, 3430 mAh battery, 32 GB storage, 3 GB RAM, Scratch-resistant glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-z5-premium-.jpg",
      "specs": ""
    },
    {
      "name": "Xperia Z5 Premium",
      "title": "Sony Xperia Z5 Premium Android smartphone. Announced Sep 2015. Features 5.5″  display, Snapdragon 810 chipset, 23 MP primary camera, 5.1 MP front camera, 3430 mAh battery, 32 GB storage, 3 GB RAM, Scratch-resistant glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-z5-premium-.jpg",
      "specs": ""
    },
    {
      "name": "Xperia Z5 Dual",
      "title": "Sony Xperia Z5 Dual Android smartphone. Announced Sep 2015. Features 5.2″  display, Snapdragon 810 chipset, 23 MP primary camera, 5.1 MP front camera, 2900 mAh battery, 32 GB storage, 3 GB RAM, Scratch-resistant glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-z5-.jpg",
      "specs": ""
    },
    {
      "name": "Xperia Z5",
      "title": "Sony Xperia Z5 Android smartphone. Announced Sep 2015. Features 5.2″  display, Snapdragon 810 chipset, 23 MP primary camera, 5.1 MP front camera, 2900 mAh battery, 32 GB storage, 3 GB RAM, Scratch-resistant glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-z5-.jpg",
      "specs": ""
    },
    {
      "name": "Xperia Z5 Compact",
      "title": "Sony Xperia Z5 Compact Android smartphone. Announced Sep 2015. Features 4.6″  display, Snapdragon 810 chipset, 23 MP primary camera, 5.1 MP front camera, 2700 mAh battery, 32 GB storage, 2 GB RAM, Scratch-resistant glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-z5-compact-.jpg",
      "specs": ""
    },
    {
      "name": "Xperia M5 Dual",
      "title": "Sony Xperia M5 Dual Android smartphone. Announced Aug 2015. Features 5.0″  display, MT6795 Helio X10 chipset, 21.2 MP primary camera, 13 MP front camera, 2600 mAh battery, 16 GB storage, 3 GB RAM, Scratch-resistant glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-m5.jpg",
      "specs": ""
    },
    {
      "name": "Xperia M5",
      "title": "Sony Xperia M5 Android smartphone. Announced Aug 2015. Features 5.0″  display, MT6795 Helio X10 chipset, 21.2 MP primary camera, 13 MP front camera, 2600 mAh battery, 16 GB storage, 3 GB RAM, Scratch-resistant glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-m5.jpg",
      "specs": ""
    },
    {
      "name": "Xperia C5 Ultra Dual",
      "title": "Sony Xperia C5 Ultra Dual Android smartphone. Announced Aug 2015. Features 6.0″  display, MT6752 chipset, 13 MP primary camera, 13 MP front camera, 2930 mAh battery, 16 GB storage, 2 GB RAM, Scratch-resistant.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-c5-ultra.jpg",
      "specs": ""
    },
    {
      "name": "Xperia C5 Ultra",
      "title": "Sony Xperia C5 Ultra Android smartphone. Announced Aug 2015. Features 6.0″  display, MT6752 chipset, 13 MP primary camera, 13 MP front camera, 2930 mAh battery, 16 GB storage, 2 GB RAM, Scratch-resistant.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-c5-ultra.jpg",
      "specs": ""
    },
    {
      "name": "Xperia Z4v",
      "title": "Sony Xperia Z4v Android smartphone. Announced Jun 2015. Features 5.2″  display, Snapdragon 810 chipset, 20.7 MP primary camera, 5.1 MP front camera, 3000 mAh battery, 32 GB storage, 3 GB RAM, Scratch-resistant glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-z4v-.jpg",
      "specs": ""
    },
    {
      "name": "Xperia Z3+ dual",
      "title": "Sony Xperia Z3+ dual Android smartphone. Announced May 2015. Features 5.2″  display, Snapdragon 810 chipset, 20.7 MP primary camera, 5.1 MP front camera, 2930 mAh battery, 32 GB storage, 3 GB RAM, Scratch-resistant glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-z4.jpg",
      "specs": ""
    },
    {
      "name": "Xperia Z3+",
      "title": "Sony Xperia Z3+ Android smartphone. Announced May 2015. Features 5.2″  display, Snapdragon 810 chipset, 20.7 MP primary camera, 5.1 MP front camera, 2930 mAh battery, 32 GB storage, 3 GB RAM, Scratch-resistant glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-z4.jpg",
      "specs": ""
    },
    {
      "name": "Xperia C4 Dual",
      "title": "Sony Xperia C4 Dual Android smartphone. Announced May 2015. Features 5.5″  display, MT6752 chipset, 13 MP primary camera, 5 MP front camera, 2600 mAh battery, 16 GB storage, 2 GB RAM, Scratch-resistant.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-c4-new.jpg",
      "specs": ""
    },
    {
      "name": "Xperia C4",
      "title": "Sony Xperia C4 Android smartphone. Announced May 2015. Features 5.5″  display, MT6752 chipset, 13 MP primary camera, 5 MP front camera, 2600 mAh battery, 16 GB storage, 2 GB RAM, Scratch-resistant.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-c4-new.jpg",
      "specs": ""
    },
    {
      "name": "Xperia M4 Aqua Dual",
      "title": "Sony Xperia M4 Aqua Dual Android smartphone. Announced Mar 2015. Features 5.0″  display, Snapdragon 615 chipset, 13 MP primary camera, 5 MP front camera, 2400 mAh battery, 16 GB storage, 2 GB RAM, Scratch-resistant glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-m4-aqua.jpg",
      "specs": ""
    },
    {
      "name": "Xperia M4 Aqua",
      "title": "Sony Xperia M4 Aqua Android smartphone. Announced Mar 2015. Features 5.0″  display, Snapdragon 615 chipset, 13 MP primary camera, 5 MP front camera, 2400 mAh battery, 16 GB storage, 2 GB RAM, Scratch-resistant glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-m4-aqua.jpg",
      "specs": ""
    },
    {
      "name": "Xperia Z4 Tablet WiFi",
      "title": "Sony Xperia Z4 Tablet WiFi Android tablet. Announced Mar 2015. Features 10.1″  display, Snapdragon 810 chipset, 8.1 MP primary camera, 5.1 MP front camera, 6000 mAh battery, 32 GB storage, 3 GB RAM, Scratch-resistant glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/-sony-xperia-z4-tablet.jpg",
      "specs": ""
    },
    {
      "name": "Xperia Z4 Tablet LTE",
      "title": "Sony Xperia Z4 Tablet LTE Android tablet. Announced Mar 2015. Features 10.1″  display, Snapdragon 810 chipset, 8.1 MP primary camera, 5.1 MP front camera, 6000 mAh battery, 32 GB storage, 3 GB RAM, Scratch-resistant glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/-sony-xperia-z4-tablet.jpg",
      "specs": ""
    },
    {
      "name": "Xperia E4g",
      "title": "Sony Xperia E4g Android smartphone. Announced Feb 2015. Features 4.7″  display, MediaTek MT6732 chipset, 5 MP primary camera, 2 MP front camera, 2300 mAh battery, 8 GB storage, 1000 MB RAM, Scratch-resistant glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-e4g.jpg",
      "specs": ""
    },
    {
      "name": "Xperia E4g Dual",
      "title": "Sony Xperia E4g Dual Android smartphone. Announced Feb 2015. Features 4.7″  display, MediaTek MT6732 chipset, 5 MP primary camera, 2 MP front camera, 2300 mAh battery, 8 GB storage, 1000 MB RAM, Scratch-resistant glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-e4g.jpg",
      "specs": ""
    },
    {
      "name": "Xperia E4 Dual",
      "title": "Sony Xperia E4 Dual Android smartphone. Announced Feb 2015. Features 5.0″  display, MT6582 chipset, 5 MP primary camera, 2 MP front camera, 2300 mAh battery, 8 GB storage, 1000 MB RAM, Scratch-resistant glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-e4.jpg",
      "specs": ""
    },
    {
      "name": "Xperia E4",
      "title": "Sony Xperia E4 Android smartphone. Announced Feb 2015. Features 5.0″  display, MT6582 chipset, 5 MP primary camera, 2 MP front camera, 2300 mAh battery, 8 GB storage, 1000 MB RAM, Scratch-resistant glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-e4.jpg",
      "specs": ""
    },
    {
      "name": "Xperia E3 Dual",
      "title": "Sony Xperia E3 Dual Android smartphone. Announced Sep 2014. Features 4.5″  display, Snapdragon 400 chipset, 5 MP primary camera, 2330 mAh battery, 4 GB storage, 1000 MB RAM, Shatter proof glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-e3-dual.jpg",
      "specs": ""
    },
    {
      "name": "Xperia E3",
      "title": "Sony Xperia E3 Android smartphone. Announced Sep 2014. Features 4.5″  display, Snapdragon 400 chipset, 5 MP primary camera, 2330 mAh battery, 4 GB storage, 1000 MB RAM, Shatter proof glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-e3-dual.jpg",
      "specs": ""
    },
    {
      "name": "Xperia Z3 Tablet Compact",
      "title": "Sony Xperia Z3 Tablet Compact Android tablet. Announced Sep 2014. Features 8.0″  display, Snapdragon 801 chipset, 8.1 MP primary camera, 2.2 MP front camera, 4500 mAh battery, 16 GB storage, 3 GB RAM, Shatter proof glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-z3-tablet-compact.jpg",
      "specs": ""
    },
    {
      "name": "Xperia Z3 Dual",
      "title": "Sony Xperia Z3 Dual Android smartphone. Announced Sep 2014. Features 5.2″  display, Snapdragon 801 chipset, 20.7 MP primary camera, 2.2 MP front camera, 3100 mAh battery, 32 GB storage, 3 GB RAM, Shatter proof glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-z3.jpg",
      "specs": ""
    },
    {
      "name": "Xperia Z3v",
      "title": "Sony Xperia Z3v Android smartphone. Announced Oct 2014. Features 5.2″  display, Snapdragon 801 chipset, 20.7 MP primary camera, 2.2 MP front camera, 3200 mAh battery, 32 GB storage, 3 GB RAM, Shatter proof glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-z3v.jpg",
      "specs": ""
    },
    {
      "name": "Xperia Z3",
      "title": "Sony Xperia Z3 Android smartphone. Announced Sep 2014. Features 5.2″  display, Snapdragon 801 chipset, 20.7 MP primary camera, 2.2 MP front camera, 3100 mAh battery, 32 GB storage, 3 GB RAM, Scratch-resistant glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-z3.jpg",
      "specs": ""
    },
    {
      "name": "Xperia M2 Aqua",
      "title": "Sony Xperia M2 Aqua Android smartphone. Announced Aug 2014. Features 4.8″  display, Snapdragon 400 chipset, 8 MP primary camera, 2300 mAh battery, 8 GB storage, 1000 MB RAM, Scratch-resistant glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-m2.jpg",
      "specs": ""
    },
    {
      "name": "Xperia Z3 Compact",
      "title": "Sony Xperia Z3 Compact Android smartphone. Announced Sep 2014. Features 4.6″  display, Snapdragon 801 chipset, 20.7 MP primary camera, 2.2 MP front camera, 2600 mAh battery, 16 GB storage, 2 GB RAM, Shatter proof glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-z3-compact.jpg",
      "specs": ""
    },
    {
      "name": "Xperia C3 Dual",
      "title": "Sony Xperia C3 Dual Android smartphone. Announced Jul 2014. Features 5.5″  display, Snapdragon 400 chipset, 8 MP primary camera, 5 MP front camera, 2500 mAh battery, 8 GB storage, 1000 MB RAM.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-c3.jpg",
      "specs": ""
    },
    {
      "name": "Xperia C3",
      "title": "Sony Xperia C3 Android smartphone. Announced Jul 2014. Features 5.5″  display, Snapdragon 400 chipset, 8 MP primary camera, 5 MP front camera, 2500 mAh battery, 8 GB storage, 1000 MB RAM.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-c3.jpg",
      "specs": ""
    },
    {
      "name": "Xperia Z2a",
      "title": "Sony Xperia Z2a Android smartphone. Announced Jun 2014. Features 5.0″  display, Snapdragon 801 chipset, 20.7 MP primary camera, 3000 mAh battery, 16 GB storage, 3 GB RAM, Shatter proof glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-z2a.jpg",
      "specs": ""
    },
    {
      "name": "Xperia T3",
      "title": "Sony Xperia T3 Android smartphone. Announced Jun 2014. Features 5.3″  display, Snapdragon 400 chipset, 8 MP primary camera, 1.1 MP front camera, 2500 mAh battery, 8 GB storage, 1000 MB RAM.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-t3.jpg",
      "specs": ""
    },
    {
      "name": "SmartWatch 3 SWR50",
      "title": "Sony SmartWatch 3 SWR50 Android watch. Announced Feb 2014. Features 1.6″  display, 420 mAh battery, 4 GB storage, 512 MB RAM.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-smartwatch-3-swr50.jpg",
      "specs": ""
    },
    {
      "name": "SmartWatch 2 SW2",
      "title": "Sony SmartWatch 2 SW2 Android watch. Announced Jun 2013. Features 1.6″  display, 225 mAh battery.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-smartwatch-2.jpg",
      "specs": ""
    },
    {
      "name": "Xperia M2",
      "title": "Sony Xperia M2 Android smartphone. Announced Feb 2014. Features 4.8″  display, Snapdragon 400 chipset, 8 MP primary camera, 2300 mAh battery, 8 GB storage, 1000 MB RAM, Corning Gorilla Glass 3.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-m2.jpg",
      "specs": ""
    },
    {
      "name": "Xperia M2 dual",
      "title": "Sony Xperia M2 dual Android smartphone. Announced Feb 2014. Features 4.8″  display, Snapdragon 400 chipset, 8 MP primary camera, 2300 mAh battery, 8 GB storage, 1000 MB RAM, Corning Gorilla Glass 3.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-m2.jpg",
      "specs": ""
    },
    {
      "name": "Xperia Z2 Tablet LTE",
      "title": "Sony Xperia Z2 Tablet LTE Android tablet. Announced Feb 2014. Features 10.1″  display, Snapdragon 801 chipset, 8.1 MP primary camera, 2.2 MP front camera, 6000 mAh battery, 16 GB storage, 3 GB RAM, Shatter proof glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-z2-tablet.jpg",
      "specs": ""
    },
    {
      "name": "Xperia Z2 Tablet Wi-Fi",
      "title": "Sony Xperia Z2 Tablet Wi-Fi Android tablet. Announced Feb 2014. Features 10.1″  display, Snapdragon 801 chipset, 8.1 MP primary camera, 2.2 MP front camera, 6000 mAh battery, 32 GB storage, 3 GB RAM, Shatter proof glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-z2-tablet.jpg",
      "specs": ""
    },
    {
      "name": "Xperia Z2",
      "title": "Sony Xperia Z2 Android smartphone. Announced Feb 2014. Features 5.2″  display, Snapdragon 801 chipset, 20.7 MP primary camera, 2.2 MP front camera, 3200 mAh battery, 16 GB storage, 3 GB RAM, Shatter proof glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-z2-new.jpg",
      "specs": ""
    },
    {
      "name": "Xperia E1 dual",
      "title": "Sony Xperia E1 dual Android smartphone. Announced Jan 2014. Features 4.0″  display, Snapdragon 200 chipset, 3.15 MP primary camera, 1750 mAh battery, 4 GB storage, 512 MB RAM, Scratch-resistant glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-e1.jpg",
      "specs": ""
    },
    {
      "name": "Xperia E1",
      "title": "Sony Xperia E1 Android smartphone. Announced Jan 2014. Features 4.0″  display, Snapdragon 200 chipset, 3.15 MP primary camera, 1750 mAh battery, 4 GB storage, 512 MB RAM, Scratch-resistant glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-e1.jpg",
      "specs": ""
    },
    {
      "name": "Xperia T2 Ultra dual",
      "title": "Sony Xperia T2 Ultra dual Android smartphone. Announced Jan 2014. Features 6.0″  display, Snapdragon 400 chipset, 13 MP primary camera, 1.1 MP front camera, 3000 mAh battery, 8 GB storage, 1000 MB RAM.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-t2-ultra-ss.jpg",
      "specs": ""
    },
    {
      "name": "Xperia T2 Ultra",
      "title": "Sony Xperia T2 Ultra Android smartphone. Announced Jan 2014. Features 6.0″  display, Snapdragon 400 chipset, 13 MP primary camera, 1.1 MP front camera, 3000 mAh battery, 8 GB storage, 1000 MB RAM.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-t2-ultra-ss.jpg",
      "specs": ""
    },
    {
      "name": "Xperia Z1s",
      "title": "Sony Xperia Z1s Android smartphone. Announced Jan 2014. Features 5.0″  display, Snapdragon 800 chipset, 20.7 MP primary camera, 2 MP front camera, 3000 mAh battery, 32 GB storage, 2 GB RAM, Shatter proof glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-z1s-ofic.jpg",
      "specs": ""
    },
    {
      "name": "Xperia Z1 Compact",
      "title": "Sony Xperia Z1 Compact Android smartphone. Announced Jan 2014. Features 4.3″  display, Snapdragon 800 chipset, 20.7 MP primary camera, 2 MP front camera, 2300 mAh battery, 16 GB storage, 2 GB RAM, Shatter proof glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-z1-compact-new.jpg",
      "specs": ""
    },
    {
      "name": "Xperia Z1",
      "title": "Sony Xperia Z1 Android smartphone. Announced Sep 2013. Features 5.0″  display, Snapdragon 800 chipset, 20.7 MP primary camera, 2 MP front camera, 3000 mAh battery, 16 GB storage, 2 GB RAM, Shatter proof glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-z1-ofic.jpg",
      "specs": ""
    },
    {
      "name": "Xperia Z Ultra",
      "title": "Sony Xperia Z Ultra Android smartphone. Announced Jun 2013. Features 6.4″  display, Snapdragon 800 chipset, 8 MP primary camera, 2 MP front camera, 3050 mAh battery, 16 GB storage, 2 GB RAM, Shatter proof glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-z-ultra.jpg",
      "specs": ""
    },
    {
      "name": "Xperia C",
      "title": "Sony Xperia C Android smartphone. Announced Jun 2013. Features 5.0″  display, MT6589 chipset, 8 MP primary camera, 2390 mAh battery, 4 GB storage, 1000 MB RAM, Yes.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-c.jpg",
      "specs": ""
    },
    {
      "name": "Xperia M",
      "title": "Sony Xperia M Android smartphone. Announced Jun 2013. Features 4.0″  display, Snapdragon S4 Plus MSM8227 chipset, 5 MP primary camera, 1750 mAh battery, 4 GB storage, 1000 MB RAM, Scratch-resistant glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-m.jpg",
      "specs": ""
    },
    {
      "name": "Xperia ZR",
      "title": "Sony Xperia ZR Android smartphone. Announced May 2013. Features 4.55″  display, Snapdragon S4 Pro chipset, 13.1 MP primary camera, 2300 mAh battery, 8 GB storage, 2 GB RAM, Shatter proof glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-zr.jpg",
      "specs": ""
    },
    {
      "name": "Xperia L",
      "title": "Sony Xperia L Android smartphone. Announced Mar 2013. Features 4.3″  display, Snapdragon 400 chipset, 8 MP primary camera, 1750 mAh battery, 8 GB storage, 1000 MB RAM, Scratch-resistant glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-l-new.jpg",
      "specs": ""
    },
    {
      "name": "Xperia SP",
      "title": "Sony Xperia SP Android smartphone. Announced Mar 2013. Features 4.6″  display, Snapdragon S4 Pro chipset, 8 MP primary camera, 2370 mAh battery, 8 GB storage, 1000 MB RAM, Corning Gorilla Glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia_sp.jpg",
      "specs": ""
    },
    {
      "name": "Xperia Tablet Z Wi-Fi",
      "title": "Sony Xperia Tablet Z Wi-Fi Android tablet. Announced Feb 2013. Features 10.1″  display, Snapdragon 600 chipset, 8.1 MP primary camera, 2.2 MP front camera, 6000 mAh battery, 32 GB storage, 2 GB RAM, Shatter proof glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-tablet-z-new.jpg",
      "specs": ""
    },
    {
      "name": "Xperia Tablet Z LTE",
      "title": "Sony Xperia Tablet Z LTE Android tablet. Announced Feb 2013. Features 10.1″  display, Snapdragon S4 Pro chipset, 8.1 MP primary camera, 2.2 MP front camera, 6000 mAh battery, 16 GB storage, 2 GB RAM, Shatter proof glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-tablet-z-new.jpg",
      "specs": ""
    },
    {
      "name": "Xperia Z",
      "title": "Sony Xperia Z Android smartphone. Announced Jan 2013. Features 5.0″  display, Snapdragon S4 Pro chipset, 13.1 MP primary camera, 2.2 MP front camera, 2330 mAh battery, 16 GB storage, 2 GB RAM, Shatter proof glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-z.jpg",
      "specs": ""
    },
    {
      "name": "Xperia ZL",
      "title": "Sony Xperia ZL Android smartphone. Announced Jan 2013. Features 5.0″  display, Snapdragon S4 Pro chipset, 13 MP primary camera, 2 MP front camera, 2370 mAh battery, 16 GB storage, 2 GB RAM, Shatter proof glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-zl.jpg",
      "specs": ""
    },
    {
      "name": "Xperia E dual",
      "title": "Sony Xperia E dual Android smartphone. Announced Dec 2012. Features 3.5″  display, Snapdragon S1 chipset, 3.15 MP primary camera, 1530 mAh battery, 4 GB storage, 512 MB RAM, Scratch-resistant glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-e-dual.jpg",
      "specs": ""
    },
    {
      "name": "Xperia E",
      "title": "Sony Xperia E Android smartphone. Announced Dec 2012. Features 3.5″  display, Snapdragon S1 chipset, 3.15 MP primary camera, 1530 mAh battery, 4 GB storage, 512 MB RAM, Scratch-resistant glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-e.jpg",
      "specs": ""
    },
    {
      "name": "Xperia T LTE",
      "title": "Sony Xperia T LTE Android smartphone. Announced Oct 2012. Features 4.55″  display, Snapdragon S4 Plus chipset, 13 MP primary camera, 1.3 MP front camera, 1850 mAh battery, 16 GB storage, 1000 MB RAM, Shatter proof glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-tl.jpg",
      "specs": ""
    },
    {
      "name": "Xperia Tablet S 3G",
      "title": "Sony Xperia Tablet S 3G Android tablet. Announced Aug 2012. Features 9.4″  display, Nvidia Tegra 3 chipset, 8 MP primary camera, 1 MP front camera, 6000 mAh battery, 64 GB storage, 1000 MB RAM, Oleophobic coating.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-tablet-s-ofic.jpg",
      "specs": ""
    },
    {
      "name": "Xperia Tablet S",
      "title": "Sony Xperia Tablet S Android tablet. Announced Aug 2012. Features 9.4″  display, Nvidia Tegra 3 chipset, 8 MP primary camera, 1 MP front camera, 6000 mAh battery, 64 GB storage, 1000 MB RAM, Oleophobic coating.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-tablet-s-ofic.jpg",
      "specs": ""
    },
    {
      "name": "Xperia V",
      "title": "Sony Xperia V Android smartphone. Announced Aug 2012. Features 4.3″  display, Snapdragon S4 Plus chipset, 13 MP primary camera, 1750 mAh battery, 8 GB storage, 1000 MB RAM, Scratch-resistant glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-v.jpg",
      "specs": ""
    },
    {
      "name": "Xperia J",
      "title": "Sony Xperia J Android smartphone. Announced Aug 2012. Features 4.0″  display, Snapdragon S1 chipset, 5 MP primary camera, 1750 mAh battery, 4 GB storage, 512 MB RAM, Corning Gorilla Glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-j.jpg",
      "specs": ""
    },
    {
      "name": "Xperia TX",
      "title": "Sony Xperia TX Android smartphone. Announced Aug 2012. Features 4.55″  display, Snapdragon S4 Plus chipset, 13 MP primary camera, 1.3 MP front camera, 1750 mAh battery, 16 GB storage, 1000 MB RAM, Shatter proof glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-tx.jpg",
      "specs": ""
    },
    {
      "name": "Xperia T",
      "title": "Sony Xperia T Android smartphone. Announced Aug 2012. Features 4.55″  display, Snapdragon S4 Plus chipset, 13 MP primary camera, 1.3 MP front camera, 1850 mAh battery, 16 GB storage, 1000 MB RAM, Shatter proof glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-t.jpg",
      "specs": ""
    },
    {
      "name": "Xperia SL",
      "title": "Sony Xperia SL Android smartphone. Announced Aug 2012. Features 4.3″  display, Snapdragon S3 chipset, 12 MP primary camera, 1.3 MP front camera, 1750 mAh battery, 32 GB storage, 1000 MB RAM, Scratch-resistant glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-s-ofic.jpg",
      "specs": ""
    },
    {
      "name": "Xperia tipo dual",
      "title": "Sony Xperia tipo dual Android smartphone. Announced Jun 2012. Features 3.2″  display, Snapdragon S1 chipset, 3.15 MP primary camera, 1500 mAh battery, 2.9 GB storage, 512 MB RAM, Scratch-resistant glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-tipo-dual.jpg",
      "specs": ""
    },
    {
      "name": "Xperia tipo",
      "title": "Sony Xperia tipo Android smartphone. Announced Jun 2012. Features 3.2″  display, Snapdragon S1 chipset, 3.15 MP primary camera, 1500 mAh battery, 2.9 GB storage, 512 MB RAM, Scratch-resistant glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-tipo.jpg",
      "specs": ""
    },
    {
      "name": "Xperia miro",
      "title": "Sony Xperia miro Android smartphone. Announced Jun 2012. Features 3.5″  display, Snapdragon S1 chipset, 5 MP primary camera, 1500 mAh battery, 4 GB storage, 512 MB RAM, Scratch-resistant glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-miro.jpg",
      "specs": ""
    },
    {
      "name": "Xperia go",
      "title": "Sony Xperia go Android smartphone. Announced May 2012. Features 3.5″  display, NovaThor U8500 chipset, 5 MP primary camera, 1305 mAh battery, 8 GB storage, 512 MB RAM, Scratch-resistant glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-go.jpg",
      "specs": ""
    },
    {
      "name": "Xperia acro S",
      "title": "Sony Xperia acro S Android smartphone. Announced May 2012. Features 4.3″  display, Snapdragon S3 chipset, 12 MP primary camera, 1.3 MP front camera, 1910 mAh battery, 16 GB storage, 1000 MB RAM, Shatter proof glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-acro-s.jpg",
      "specs": ""
    },
    {
      "name": "Xperia SX SO-05D",
      "title": "Sony Xperia SX SO-05D Android smartphone. Announced May 2012. Features 3.7″  display, Snapdragon S4 Plus chipset, 8 MP primary camera, 1500 mAh battery, 4 GB storage, 1000 MB RAM, Scratch-resistant glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/Sony-Xperia-SX-SO-05D.jpg",
      "specs": ""
    },
    {
      "name": "Xperia GX SO-04D",
      "title": "Sony Xperia GX SO-04D Android smartphone. Announced May 2012. Features 4.6″  display, Snapdragon S4 Plus chipset, 13 MP primary camera, 1.3 MP front camera, 1700 mAh battery, 16 GB storage, 1000 MB RAM, Scratch-resistant glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/Sony-Xperia-GX-SO-04D.jpg",
      "specs": ""
    },
    {
      "name": "Xperia acro HD SO-03D",
      "title": "Sony Xperia acro HD SO-03D Android smartphone. Announced May 2012. Features 4.3″  display, Snapdragon S3 chipset, 12 MP primary camera, 1.3 MP front camera, 1910 mAh battery, 11 GB storage, 1000 MB RAM, Scratch-resistant glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/Sony-Xperia-acro-HD-SO-03D.jpg",
      "specs": ""
    },
    {
      "name": "Xperia acro HD SOI12",
      "title": "Sony Xperia acro HD SOI12 Android smartphone. Announced May 2012. Features 4.3″  display, Snapdragon S3 chipset, 12 MP primary camera, 1.3 MP front camera, 1900 mAh battery, 11 GB storage, 1000 MB RAM, Scratch-resistant glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/Sony-Xperia-acro-HD-SOI12.jpg",
      "specs": ""
    },
    {
      "name": "Xperia neo L",
      "title": "Sony Xperia neo L Android smartphone. Announced Mar 2012. Features 4.0″  display, Snapdragon S2 chipset, 5 MP primary camera, 1500 mAh battery, 1000 MB storage, 512 MB RAM.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-neo-l.jpg",
      "specs": ""
    },
    {
      "name": "Xperia sola",
      "title": "Sony Xperia sola Android smartphone. Announced Mar 2012. Features 3.7″  display, NovaThor U8500 chipset, 5 MP primary camera, 1320 mAh battery, 8 GB storage, 512 MB RAM, Scratch-resistant glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-sola.jpg",
      "specs": ""
    },
    {
      "name": "Xperia U",
      "title": "Sony Xperia U Android smartphone. Announced Feb 2012. Features 3.5″  display, NovaThor U8500 chipset, 5 MP primary camera, 1320 mAh battery, 8 GB storage, 512 MB RAM, Scratch-resistant glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-u-ofic.jpg",
      "specs": ""
    },
    {
      "name": "Xperia P",
      "title": "Sony Xperia P Android smartphone. Announced Feb 2012. Features 4.0″  display, NovaThor U8500 chipset, 8 MP primary camera, 1305 mAh battery, 16 GB storage, 1000 MB RAM, Scratch-resistant glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-p-ofic.jpg",
      "specs": ""
    },
    {
      "name": "Xperia S",
      "title": "Sony Xperia S Android smartphone. Announced Jan 2012. Features 4.3″  display, Snapdragon S3 chipset, 12 MP primary camera, 1.3 MP front camera, 1750 mAh battery, 32 GB storage, 1000 MB RAM, Scratch-resistant glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-s-ofic.jpg",
      "specs": ""
    },
    {
      "name": "Xperia ion HSPA",
      "title": "Sony Xperia ion HSPA Android smartphone. Announced Apr 2012. Features 4.55″  display, Snapdragon S3 chipset, 12 MP primary camera, 1.3 MP front camera, 1900 mAh battery, 13.2 GB storage, 1000 MB RAM, Scratch-resistant glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-ion-hspa.jpg",
      "specs": ""
    },
    {
      "name": "Xperia ion LTE",
      "title": "Sony Xperia ion LTE Android smartphone. Announced Jan 2012. Features 4.55″  display, Snapdragon S3 chipset, 12 MP primary camera, 1.3 MP front camera, 1900 mAh battery, 16 GB storage, 1000 MB RAM, Scratch-resistant glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-ion-ofic.jpg",
      "specs": ""
    },
    {
      "name": "Tablet P",
      "title": "Sony Tablet P Android tablet. Announced Q1 2012. Features 5.5″  display, Nvidia Tegra 2 T20 chipset, 5 MP primary camera, 3080 mAh battery, 4 GB storage, 1000 MB RAM.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-tablet-p.jpg",
      "specs": ""
    },
    {
      "name": "Tablet P 3G",
      "title": "Sony Tablet P 3G Android tablet. Announced Aug 2011. Features 5.5″  display, Nvidia Tegra 2 T20 chipset, 5 MP primary camera, 3080 mAh battery, 4 GB storage, 1000 MB RAM.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-tablet-p.jpg",
      "specs": ""
    },
    {
      "name": "Tablet S 3G",
      "title": "Sony Tablet S 3G Android tablet. Announced Aug 2011. Features 9.4″  display, Nvidia Tegra 2 T20 chipset, 5 MP primary camera, 32 GB storage, 1000 MB RAM.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-tablet-s.jpg",
      "specs": ""
    },
    {
      "name": "Tablet S",
      "title": "Sony Tablet S Android tablet. Announced Aug 2011. Features 9.4″  display, Nvidia Tegra 2 T20 chipset, 5 MP primary camera, 32 GB storage, 1000 MB RAM.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-tablet-s.jpg",
      "specs": ""
    },
    {
      "name": "CMD Z7",
      "title": "Sony CMD Z7 phone. Announced Q4 2001. Features Grayscale graphic, 4 shades display.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/soz7.gif",
      "specs": ""
    },
    {
      "name": "Xperia LT29i Hayabusa",
      "title": "Sony Xperia LT29i Hayabusa Android smartphone. Announced Aug 2012. Features 4.6″  display, Snapdragon S4 Plus chipset, 13 MP primary camera, 1700 mAh battery, 1000 MB RAM, Scratch-resistant glass.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-xperia-lt29i-hayabusa.jpg",
      "specs": ""
    },
    {
      "name": "CMD J70",
      "title": "Sony CMD J70 phone. Announced Q4 2001. Features Grayscale graphic, 4 shades display, 650 mAh battery.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/soj70.gif",
      "specs": ""
    },
    {
      "name": "CMD J7",
      "title": "Sony CMD J7 phone. Announced Q4 2001. Features Grayscale graphic, 4 shades display, 650 mAh battery.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/soj7.gif",
      "specs": ""
    },
    {
      "name": "CMD MZ5",
      "title": "Sony CMD MZ5 phone. Announced May 2001. Features Grayscale graphic, 4 shades display, 620 mAh battery.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/sony-cmd-mz5.jpg",
      "specs": ""
    },
    {
      "name": "CMD J6",
      "title": "Sony CMD J6 phone. Announced  2001. Features Grayscale graphic, 4 shades display, 650 mAh battery.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/soj6.gif",
      "specs": ""
    },
    {
      "name": "CMD J5",
      "title": "Sony CMD J5 phone. Announced  2000. Features Grayscale graphic, 4 shades display, 540 mAh battery.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/soj5.gif",
      "specs": ""
    },
    {
      "name": "CMD Z5",
      "title": "Sony CMD Z5 phone. Announced  2000. Features Grayscale graphic, 4 shades display, 500 mAh battery.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/soz5b.gif",
      "specs": ""
    },
    {
      "name": "CMD CD5",
      "title": "Sony CMD CD5 phone. Announced  2000. Features Monochrome graphic display, 500 mAh battery.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/socd5b.gif",
      "specs": ""
    },
    {
      "name": "CMD C1",
      "title": "Sony CMD C1 phone. Announced  1999. Features Monochrome graphic display, 500 mAh battery.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/soc1b.gif",
      "specs": ""
    },
    {
      "name": "CMD Z1 plus",
      "title": "Sony CMD Z1 plus phone. Announced  1997. Features Monochrome graphic display, 600 mAh battery.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/soz1pb.gif",
      "specs": ""
    },
    {
      "name": "CMD Z1",
      "title": "Sony CMD Z1 phone. Announced  1997. Features Monochrome graphic display, 730 mAh battery.",
      "image": "https://fdn2.gsmarena.com/vv/bigpic/soz1b.gif",
      "specs": ""
    }
  ]
}